//**************************************************
//
// Hackathon ( player.cpp )
// Author  : katsuki mizuki
//
//**************************************************

//==================================================
// インクルード
//==================================================
#include "rectangle3D.h"
#include "polygon.h"
#include "texture.h"
#include "color.h"

#include <assert.h>

//==================================================
// 定義
//==================================================
namespace
{
const float	PLAYER_SIZE = 30.0f;	// プレイヤーのサイズ
}// namespaceはここまで

 //==================================================
 // スタティック変数
 //==================================================
namespace
{
int	s_idx3DPlayer;	// 3D矩形のインデックス
}// namespaceはここまで

 //--------------------------------------------------
 // 初期化
 //--------------------------------------------------
void InitPlayer(void)
{
	// 3D矩形の設定
	s_idx3DPlayer = SetRectangle3D(TEXTURE_NONE);

	D3DXVECTOR3 size = D3DXVECTOR3(PLAYER_SIZE, PLAYER_SIZE, 0.0f);

	// 3D矩形の位置の設定
	SetSizeRectangle3D(s_idx3DPlayer, size);
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitPlayer(void)
{
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdatePlayer(void)
{
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawPlayer(void)
{
}
