//**************************************************
// 
// score.h
// Author  : katsuki mizuki
// 
//**************************************************
#ifndef _SCORE_H_	//このマクロ定義がされてなかったら
#define _SCORE_H_	//２重インクルード防止のマクロ定義

//==================================================
// インクルード
//==================================================
#include <d3dx9.h>

//==================================================
// 前方宣言
//==================================================
class CNumberManager;

//==================================================
// 定義
//==================================================
class CScore
{
	/* ↓静的メンバ関数↓ */
public:
	static CScore* Create(const D3DXVECTOR3& pos);	// 生成

	/* ↓メンバ関数↓ */
public:
	CScore();	// デフォルトコンストラクタ
	~CScore();	// デストラクタ

public:
	void Init(const D3DXVECTOR3& pos);	// 初期化
	void Uninit();						// 終了

	/* ↓メンバ変数↓ */
private:
	CNumberManager* m_pNumber;	// 数字
	int m_score;				// スコア
};

#endif // !_SCORE_H_
